app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE (created_at >= '2021-12-31')
---
  def index
    @entries = Entry.where("created_at >= ?", Date.today )

INSERT INTO "entries" ("meal_type", "calories", "protiens", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Breakfast"], ["calories", 120], ["protiens", 23], ["carbohydrates", 530], ["fats", 221], ["created_at", "2021-12-07 01:16:22.497825"], ["updated_at", "2021-12-07 01:16:22.497825"]]
---
  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save

UPDATE "entries" SET "fats" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["fats", 222], ["updated_at", "2021-12-07 01:17:02.793727"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @entry.update(entry_params)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_entry
      @entry = Entry.find(params[:id])